/* НАХОЖДЕНИЕ МАКСИМАЛЬНОГО ОБЩЕГО ДЕЛИТЕЛЯ 2 ЧИСЕЛ
 --------------------------------------------------
 Для нахождение общего максимального делителя будет использоваться Алгоритм Евклида.

 Суть алгоритма: Берём остаток от деления большего числа на меньшее и приравниваем большей переменной этот остаток.
 Повторяем такую операцию до тех пор, пока одно из чисел не будет равно нулю.
 В этот момент второе ненулевое число будет ответом.

 Псевдокод: а и b - числа максимальный общий делитель чьих нужно найти.

 ПОКА а!=0 и b!=0:
     ЕСЛИ a > b:
         a = a % b
     ЕСЛИ b > a:
         b = b % a:
 ЕСЛИ а=0:
    ВЕРНУТЬ b
 ЕСЛИ b=0
    ВЕРНУТЬ a

 СЛОЖНОСТЬ АЛГОРИТМА: не больше чем log2A + log2B. Так как у нас каждое из двух чисел постоянно делится на больше, чем 2.

*/
using Console = System.Console;

var a = 14159572;
var b = 63967072;

//Пример алгоритма
while (a != 0 && b != 0)
{
    if (a >= b)
    {
        a = a % b;
        continue;
    }

    if (b >= a)
        b = b % a;
}

if (a == 0)
    Console.WriteLine(b);
else
    Console.WriteLine(a);

//Пример рекурсивной функции
long EwklidAlgorithm(long a, long b)
{
    if (a == 0)
        return b;
    if (b == 0)
        return a;

    if (a >= b)
        return EwklidAlgorithm(a % b, b);
    if (b >= a)
        return EwklidAlgorithm(a, b % a);

    return 0;
}

Console.WriteLine(EwklidAlgorithm(a,b));